TT='com.zhiliaoapp.musically'
TT注册界面1={
	界面特征={'TT注册界面1',0x161823, "217|-32|0xe3e3e4,126|11|0xa9aaae,381|11|0x161823,266|54|0xe3e3e4,391|762|0xfe2c55,64|766|0x161823",90,117,455,514,1259}
}
TT注册界面2={
	界面特征={'TT注册界面2',0x000000, "132|-59|0xe3e3e4,371|-59|0xe3e3e4,374|-26|0x1f212c,123|-13|0x161823,193|26|0xe3e3e4,57|774|0x161823,460|774|0xfe3159",90,123,427,589,1269}
}
TT注册界面3={
	界面特征={'TT注册界面3',0xfffeff, "142|15|0xfe2c55,-8|117|0x1877f2,228|88|0xe3e3e4",90,100,450,345,575}
}
TT注册界面4={
	界面特征={'TT注册界面4',0x161823, "329|12|0x161823,264|108|0xffffff,124|368|0xe3e3e4,47|403|0x1877f2",90,75,203,410,612}
}
TT注册界面5={
	界面特征={'TT注册界面5',0xe3e3e4, "612|86|0xe3e3e4,56|37|0x1877f2,57|154|0x5070a8,432|152|0x161823", 90,44,548,700,901}
}
------------------------------------------------------------------------------------------------------------------------
TT注册界面6={
	界面特征={'TT注册界面1',0xd53e36, "-11|9|0xd53e36,-7|31|0x2f9d4f,3|31|0x2f9d4f,-7|15|0xffffff,1|18|0x5070a8,10|18|0x5070a8,118|18|0x161823",90,77,371,290,1158}
}
------------------------------------------------------------------------------------------------------------------------
TT设置生日界面={
	界面特征={'TT设置生日界面',0x161823, "201|79|0x8a8b91,-10|233|0x161823,177|233|0x161823,147|864|0xeeeef0",90,313,183,531,1053}
}
TT设置生日界面2={
	界面特征={'TT设置生日界面',0x161823, "369|0|0x161823,-4|64|0x8a8b91,74|12|0xffffff,140|857|0xeeeef0,322|859|0xeeeef0",90,143,187,523,1052}
}
TT设置生日界面3={
	界面特征={'TT设置生日界面',0x161823, "285|24|0x161823,434|50|0x78ebfa,478|52|0x78ebfa,454|73|0xffffff,500|93|0x161823,477|857|0xeeeef0",90,170,184,676,1047}
}
TT注册电话界面={
	界面特征={'TT注册电话界面',0x161823,"336|0|0x161823,503|1|0xd0d1d3",90,35,205,540,210}
}
--TT注册邮箱界面={
--	界面特征={'TT注册邮箱界面',0xd0d1d3,"348|-2|0x161823,644|-1|0x161823",90,26,204,677,210}
--}
TT注册邮箱界面={
	界面特征={'TT注册邮箱界面',0x161823, "20|9|0x161823,79|6|0x161823,374|13|0x8a8b90,374|23|0x8a8b90,-156|87|0x8a8b90,-122|92|0x8a8b90,-158|316|0x161823,-280|7|0x161823", 90, 21, 48, 727, 408}
}
TT注册密码界面={
	界面特征={'TT注册密码界面',0x161823,"-5|128|0x161823,-33|285|0x8a8b91,-66|312|0x161823,-19|133|0xffffff",93,273,70,345,387}
}
TT注册密码界面2={
	界面特征={'TT注册密码界面',0x161823, "129|-4|0x161823,127|-4|0xd0d1d3,10|223|0x363841,106|217|0x66686f,186|-108|0x161823,186|-109|0x97989d,163|212|0xffffff",90,232,86,424,425}
}
TT注册打码界面={
	界面特征={'TT注册打码界面',0x222222,"167|4|0x222222,536|-11|0x999999,56|441|0xb3b5b7,27|512|0x505050",90,100,395,640,924}
}
TT注册用户名界面={
	界面特征={'TT注册用户名界面',0x8a8b91,"268|0|0x161823,258|183|0x8a8b91,256|155|0xffffff,285|426|0xfe2c55",90,70,70,360,502}
}
TT注册用户名界面2={
	界面特征={'TT注册用户名界面2',0x8a8b91, "268|-2|0x161823,350|12|0xffffff,388|193|0x8a8b91,287|346|0x8a8b91,58|346|0x8a8b91",90,70,68,465,423}
}
TT注册用户名界面3={
	界面特征={'TT注册用户名界面',0x161823, "215|8|0x161823,264|-96|0x161823,67|225|0xff4c3a,67|224|0xffffff,411|225|0xff4c3a,411|226|0xffffff",90,151,95,568,423}
}
TT注册邮箱验证码界面={
	界面特征={'TT注册邮箱验证码界面',0x8a8b91, "22|0|0xffffff,26|0|0xffffff,56|0|0x8a8b91,-65|-166|0x94959a,197|-344|0x161823",90,65,70,334,422}
}
TT注册电话验证码界面={
	界面特征={'TT注册电话验证码界面',0x161822, "633|3|0x8a8b91,640|-7|0x8a8b91,16|89|0x161823,16|87|0x606169,329|102|0x161823,331|103|0x51535b,19|160|0x8a8b91,84|163|0x8a8b91,200|159|0x8a8b91",90,50,90,696,264}
	}
TT注册频繁界面={
	界面特征={'TT注册频繁界面',0x161823, "-200|286|0xfe3824,334|286|0xfe3824,272|335|0xfe3824,130|329|0xffffff,-54|328|0xfe3824",90,137,68,680,410}
}
TT注册账号重复界面={
	界面特征={'TT注册账号重复界面',0x161823, "-169|168|0xff4c3a,59|168|0xff4c3a,67|218|0xff4c3a,-80|18|0x161823",90,193,186,436,410}
}
TT注册账号重复界面2={
	界面特征={'TT注册账号重复界面',0x161823, "319|-4|0x606169,361|28|0x161823,75|67|0x8a8b91,69|229|0x161823,97|349|0x161823,258|516|0xa9a9ae",90,132,183,500,409}
}

--TT注册账号225界面1 = {
--	界面特征={'TT选择兴趣界面3',0x161823, "293|20|0x161823,570|-87|0x8a8b90,142|238|0x4f5159,201|1073|0xf1f1f2,279|1080|0xa6a7ab", 90,67,81,643,1254}
--}

TT注册225界面login = {
	界面特征={'TT注册225界面login',0x50525a, "-166|-661|0x161823,42|-661|0x161823,-47|-669|0x161823,110|350|0xfe2c55,193|359|0xfe2c55,144|359|0xfe2c55,345|375|0xf8f8f8", 90,207,236,724,1286}
}

TT注册225界面login2 = {
	界面特征={'TT注册225界面login2',0x161722, "145|-5|0x161722,-154|-162|0x161722,206|-16|0x161722,286|989|0xea4359,357|991|0xe9485e", 90, 6, 26, 724, 1292}
}

TT注册225界面login3 = {
	界面特征={'TT注册225界面login3',0x161722, "145|-7|0x161722,272|-15|0x161722,207|-16|0x161722,293|1020|0xea4359,359|1021|0xea4359,-95|226|0x161722", 90, 6, 4, 710, 1298}
	}
TT注册225界面login4 = {
	界面特征={'TT注册225界面login4',0xffffff, "310|-39|0x8a8b90,-273|192|0x8a8b90,-37|344|0x161722,42|298|0xe3e3e4,-9|109|0x161722,142|119|0x161722", 90, 5, 5, 743, 514}
}
TT注册225界面login5 = {
	界面特征={'TT注册225界面login5',0x8a8b91, "-173|68|0x161823,-279|59|0x161823,-384|63|0x161823,-213|1173|0xfe2c55,-129|1185|0xfe2c55,-139|1237|0xf8f8f8", 90, 10, 10, 728, 1326}
}
TT注册225界面login点击1 = {
	界面特征={'TT注册225界面login点击1',0x1b1c1d, "-15|1|0x333333,-638|-8|0x333333,-13|379|0x2d2d2d", 90,57,71,701,464}
}

TT注册225界面login点击2= {
界面特征={'TT注册225界面login点击2',0xffffff, "57|10|0xffffff,367|19|0xffffff,606|-162|0x1b1c1d,612|-155|0x333333", 90, 5, 3, 733, 362}
}

--TT注册界面login滑动= {
--界面特征={'TT注册界面login滑动',0x8a8b91, "0|19|0x8a8b91,-40|1176|0xffffff,-40|1236|0xf8f8f8", 90, 10, 12, 738, 1326}
--}

TT注册225界面用户名 = {
	界面特征={'TT注册225界面用户名',0x161823, "66|3|0x161823,-293|-1|0x161823,-248|108|0x161823,-96|124|0x161823,150|118|0x161823,-51|447|0xf1f1f2,17|437|0xa6a7ab", 90, 1, 47, 745, 613}
	}

TT注册225界面Signup = {
	界面特征={'TT注册225界面Signup',0x161823, "81|1|0x161823,258|-5|0x161823,373|12|0x161823,190|670|0x50525a,325|1025|0xfe2c55,389|1022|0xfe2c55", 90,183,230,578,1266}
}
TT登录225界面邮箱 = {
	界面特征={'TT登录225界面邮箱',0x161823, "16|2|0x161823,63|3|0x161823,361|10|0x8a8b91,100|85|0x161823,182|83|0x161823,211|90|0x161823,207|123|0x161823,-169|86|0x8a8b90,-92|88|0x8a8b90", 90, 19, 40, 747, 243}
	}
TT登录225界面验证码 = {
	界面特征 = {'TT登录225界面验证码',0x161823, "14|-9|0x51535b,89|-2|0x161823,165|-1|0x161823,201|-14|0x161823,-88|143|0x161823,-77|143|0x161823,-51|142|0x161823,49|151|0x161823,-180|360|0x8a8b91", 90, 8, 19, 733, 499}
}
TT登录225界面toomany = {
	界面特征 = {'TT登录225界面toomany',0xff4c3a, "-1|-11|0xff4c3a,138|6|0xff4c3a,263|5|0xff4c3a,394|-1|0xff4c3a,439|-1|0xff4c3a,282|-11|0xff4c3a,583|-83|0xafb0b4", 90, 39, 436, 701, 589}
}

TT登录授权弹框 = {
	界面特征 = {'TT登录授权弹框',0x000000, "46|8|0x000000,135|1|0x000000,192|41|0x000000,276|199|0x000000,283|302|0x007aff,-49|292|0x007aff,75|302|0x007aff", 90, 67, 432, 683, 901}
}
TT登录主页滑动 = {
	界面特征 = {'TT登录主页滑动',0xffffff, "40|16|0xffffff,95|9|0xffffff,183|20|0xffffff,267|-5|0xffffff,305|8|0xffffff,440|9|0xffffff,-59|403|0x7f7f7f,278|-782|0x7f7f7f,346|-781|0x7f7f7f", 90, 4, 36, 632, 1314}
}
TT登录消息界面 = {
		界面特征 = {'TT登录消息界面',0x161823, "24|-2|0x161823,31|-7|0x161823,171|-1|0x161823,405|-6|0x161823,240|1172|0x161823,130|1197|0xfa2d6c,52|1194|0x20d5ec", 90, 226, 60, 738, 1322}
	}

TT注册选择兴趣 = {
	界面特征={'TT注册选择兴趣',0x161722, "121|5|0x161722,290|9|0x161722,536|1057|0xf1f1f2,434|1046|0xa6a7aa,135|1056|0x161722", 90, 26, 164, 734, 1320}
}
TT注册选择兴趣2 = {
	界面特征={'TT注册选择兴趣2',0x161722, "78|29|0x161722,272|30|0x161722,291|273|0x161722,464|1123|0xea4359,226|1115|0xffffff", 90, 24, 104, 706, 1306}
}

--TT注册进入主页界面 = {
--	界面特征={'TT注册进入主页界面',0xffffff, "175|7|0xffffff,267|6|0xffffff,419|-2|0xffffff,543|-260|0x75202c,-81|394|0x7f7f7f", 90, 16, 48, 738, 1304}
--}

---------------------1665注册--------------------------
注册1665主页授权界面 = {
	界面特征 = {'注册1665主页授权界面',0x000000, "117|62|0x000000,174|59|0x000000,349|57|0x000000,536|47|0xcb2344,4|259|0x007aff,339|264|0x007aff,370|266|0x007aff,260|744|0xc82456,180|743|0x19aabd", 90, 20, 54, 724, 1322}
}
注册1665主页界面 = {
	界面特征 = {'注册1665主页界面',0x767575, "0|-87|0x7f162a,-563|219|0xffffff,-295|220|0xffffff,-299|623|0x7f7f7f,-279|612|0x7d1636,-360|612|0x106a76", 90, 0, 288, 734, 1322}
}
注册1665主页界面2 = {
	界面特征 = {'注册1665主页界面2',0xffffff, "67|-2|0xffffff,282|499|0xfe2c55,-78|1200|0x20d5ec,-65|1199|0xffffff,-1|1200|0xfa2d6c", 90, 4, 18, 742, 1318}
	}
注册1665signup界面 = {
	界面特征 = {'注册1665signup界面',0x8a8b90, "-19|-10|0x8a8b90,-643|2|0x161823,-513|151|0x161823,-335|155|0x161823,-191|164|0x161823,-187|1152|0xfe2c55,-130|1153|0xfe2c55", 90, 10, 68, 732, 1310}
}
注册1665邮箱注册界面2 = {
	界面特征 = {'注册1665邮箱注册界面2',0x222126, "68|-2|0x121212,178|121|0x161616,185|84|0x1a1921,364|7|0x8c8c8c,-167|84|0x8d8d8d,-292|-1|0x1b1b1b", 90, 8, 34, 743, 228}
	}
注册1665生日界面 = {
	界面特征 = {'注册1665生日界面',0xf1f1f2, "89|-3|0xa6a7ab,140|4|0xa6a7ab,-192|-156|0xafb0b4,-130|-159|0xafb0b4,-96|-147|0xafb0b4,66|-352|0x161823,66|-367|0x161823,178|-345|0x161823,202|-363|0x161823", 90, 39, 170, 710, 603}
}
注册1665已选择生日界面 = {
	界面特征 = {'注册1665已选择生日界面',0x161722, "281|-6|0x161722,176|126|0x161722,263|113|0x161722,287|102|0x161722,398|123|0x161722,176|196|0x8a8b90,172|468|0xea4359,608|315|0xafb0b3", 90, 14, 46, 712, 617}
	}

注册1665密码界面 = {
	界面特征 = {'注册1665密码界面',0xffffff, "5|-3|0x8a8b90,-620|107|0x161823,-490|115|0x161823,-351|109|0x161823,-556|165|0x8a8b90,-498|199|0x8a8b90,-554|286|0x8a8b90,-502|287|0x8a8b90,-342|421|0xa6a7ab", 90, 17, 55, 731, 577}
}
注册1665验证码未刷新界面 = {
	界面特征 = {'注册1665验证码未刷新界面',0x454548, "351|0|0x0b0b11,346|39|0x0b0b11,366|404|0xf4f5f6,31|580|0xf4f5f6,476|232|0x999999", 90, 6, 9, 736, 816}
}
注册1665手机验证号 = {
	界面特征 = {'注册1665手机验证号',0x161823, "654|10|0x8a8b90,29|118|0x161823,134|121|0x161823,32|175|0x8a8b90,154|172|0x8a8b90,255|172|0x8a8b90,318|119|0x161823", 90, 14, 31, 745, 280}
}
注册1665视频提示界面 = {
	界面特征 = {'注册1665视频提示界面',0xfefefe, "68|0|0xfefefe,-78|1199|0x20d4eb,-15|1195|0xfefefe,0|1195|0xf92d6c,-372|1094|0xedeceb,-343|1087|0xedecec,19|1126|0xececec", 90, 10, 30, 640, 1320}
}

TT注册界面列表={TT注册界面1,TT注册界面2,TT注册界面3,TT注册界面4,TT注册界面5,TT设置生日界面,TT设置生日界面2,TT设置生日界面3,TT注册电话界面,TT注册邮箱界面,TT注册密码界面,TT注册密码界面2,TT注册电话验证码界面,TT注册打码界面,TT注册用户名界面,TT注册用户名界面2,TT注册用户名界面3,TT注册邮箱验证码界面,TT注册频繁界面,TT注册账号重复界面,TT注册账号重复界面2,
				--TT注册账号225界面1
				TT注册225界面login,TT注册225界面login2,TT注册225界面login3,TT注册225界面login4,TT注册225界面login点击1,TT注册225界面Signup,TT注册选择兴趣,TT注册选择兴趣2
				--TT注册进入主页界面
				,TT注册225界面login点击2,TT注册225界面login5,TT注册225界面用户名,
				TT注册界面login滑动,
				注册1665主页界面,注册1665主页界面2,注册1665signup界面,注册1665生日界面,注册1665密码界面,注册1665验证码未刷新界面,
				注册1665已选择生日界面,注册1665主页授权界面,
				TT登录225界面验证码,TT登录主页滑动,TT登录授权弹框,TT登录消息界面,
				TT登录225界面toomany,TT登录225界面邮箱,注册1665邮箱注册界面2,注册1665手机验证号,注册1665视频提示界面}

--------------22.5.0--------
点击225signup按钮X = 514
点击225signup按钮Y = 1263

点击225login按钮X = 369
点击225login按钮Y = 472

登录225邮箱按钮X = 505
登录225邮箱按钮Y= 159


TT注册225界面login点击1X = 252	
TT注册225界面login点击1Y = 385

----------16.6.5--------------
注册1665生日X =343 
注册1665生日Y =554


TT注册选择兴趣X = 196
TT注册选择兴趣Y = 1258

TT注册选择兴趣2X = 478
TT注册选择兴趣2Y = 1258


邮箱及电话按钮X=378
邮箱及电话按钮Y=488

选择月={203,923,191,1163}
选择日={405,899,411,1175}
选择年={556,902,558,1164}

生日界面next按钮X=380
生日界面next按钮Y=560

生日界面next2按钮X=352
生日界面next2按钮Y=767

email按钮X=545
email按钮Y=170

邮箱输入框X2=478     --手机号输入框
邮箱输入框Y2=366     --手机号输入框

邮箱输入框X=102
邮箱输入框Y=347


邮箱界面next按钮X=376
邮箱界面next按钮Y=614

密码输入框X=459
密码输入框Y=332

密码界面next按钮X=373
密码界面next按钮Y=612

用户名输入框X=389
用户名输入框Y=374

用户名对勾X=660     --输入用户名后是否出现绿色对勾，如果不出现就是用户名重复
用户名对勾Y=373
对勾的颜色=0x0be09b --绿色

用户名确认按钮X=382    --就是下面的红色按钮 Sign up
用户名确认按钮Y=523




TT主界面={
	界面特征={'TT主界面',0xffffff, "-395|1141|0xffffff,-135|1157|0x20d5ec,-76|1158|0xffffff,-58|1151|0xfa2d6c",90,72,120,473,1283}
}
TT主界面2={
	界面特征={'TT主界面2',0xffffff, "-350|1189|0xffffff,-64|1190|0xffffff,-78|1197|0x20d5ec,-1|1200|0xfa2d6c",90,60,77,416,1283}
}

--erkang---
TT主界面3={
	界面特征={'TT主界面3',0x161823, "406|2|0x161823,278|91|0x161823,587|212|0x505159,5|421|0xe4e4e5,126|1059|0x161823,373|1059|0xf1f1f2", 90,72,198,665,1263}
}


TT个人主页界面={
	界面特征={'TT个人主页界面',0x8a8b90, "279|-5|0x161823,302|0|0xffffff,340|-1|0xfa2d6c,602|5|0x161823",90,70,1271,680,1289}
}
TT设置和隐私界面={
	界面特征={'TT设置和隐私界面',0x161823, "365|-1|0x161823,309|40|0xd0d1d3,107|94|0x8a8b91,275|-1|0xffffff", 90,39,83,410,185}
}
TT管理账户界面={
	界面特征={'TT管理账户界面',0x161823, "456|-5|0x161823,400|-1|0xffffff,335|42|0xd0d1d3,312|452|0xe3e4e5", 90,38,78,500,540}
}
TT企业设置界面={
	界面特征={'TT企业设置界面',0xfe2c55, "-138|122|0xfe2c55,-48|90|0x161823,-59|275|0x5e5f67,-10|360|0xfe355c",90,282,350,425,715}
}
TT选择企业类型界面={
	界面特征={'TT选择企业类型界面',0x2d2f39, "27|141|0x161823,316|149|0xffffff,337|455|0xf1f1f2,360|770|0xf1f1f2",90,37,81,403,857}
}
TT弹窗欢迎光临界面={
	界面特征={'TT弹窗欢迎光临界面',0x161823, "462|7|0x161823,232|131|0x50525a,239|321|0xf1f1f2,274|795|0x7d1636",90,138,485,605,1285}
}
TT弹窗欢迎光临界面2={
	界面特征={'TT弹窗欢迎光临界面2',0xf1f1f2, "5|101|0xf1f1f2,5|41|0x161823,48|142|0x505159,64|54|0xffffff",90,332,705,402,853}
}
TT弹窗访问照片权限界面={
	界面特征={'TT弹窗访问照片权限界面',0x0d0e15, "185|-17|0x000000,513|-8|0x000000,672|7|0x535457,493|268|0x007aff,120|274|0x007aff",90,35,520,712,817}
}
--TT个人资料设置界面={
--	界面特征={'TT个人资料设置界面',0x161823, "594|43|0xd0d1d3,363|-5|0x161823,678|665|0x8a8b90,3|463|0x161823,63|463|0xffffff",90,35,75,720,752}
--}

TT个人资料设置界面={
	界面特征={'TT个人资料设置界面',0xd0d2d4, "10|119|0xf3f3f4,-33|-139|0x161722,-321|-139|0x161722,-324|318|0x161722,347|328|0x8b8c90,81|190|0x161722", 90,33,80,710,553}
}

TT个人资料设置界面2={
	界面特征={'TT个人资料设置界面2',0xf1f1f2, "-28|48|0x161823,-96|-147|0x161823,-329|30|0xffffff,24|191|0x161823", 90, 207,82,566,426}
}

TT设置个性签名界面={
	界面特征={'TT设置个性签名界面',0x1c1e29, "309|-1|0x161823,353|12|0x161823,356|8|0xffffff,304|5|0xffffff,303|52|0xd0d1d3,278|342|0x8a8b91",90,41,71,403,420}
}
TT设置链接界面={
	界面特征={'TT设置链接界面',0x161823, "281|-5|0x161823,398|0|0x161823,392|-1|0xffffff,290|44|0xd0d1d3,290|147|0x8a8b91",90,32,75,435,233}
}
TT打开相册界面={
	界面特征={'TT打开相册界面',0x007aff, "186|9|0x067dff,87|70|0xb1b2b3,95|115|0x007aff,209|131|0x007aff,98|374|0x007aff,117|90|0xf1f0f1",90,278,885,493,1265}
}

--erkang-----------------------------------------------------------------------------
TT打开相册界面2={
	界面特征={'TT打开相册界面',0x11131c, "256|-1|0x11131c,252|804|0x007aff,231|944|0x007aff,276|1175|0x007aff,506|1192|0xffffff", 90,36,80,548,1279}
}

-------------------------------------------------------------------------------------


TT相册授权界面={
	界面特征={'TT相册授权界面',0x0a0a0a, "334|15|0x000000,106|252|0xb2b3b3,109|341|0xb2b1b3,151|430|0xb1b1b2,174|464|0x007aff,172|382|0x007aff",90,213,429,553,899}
}
TT相册授权界面2={
	界面特征={'TT相册授权界面',0x007aff, "158|-110|0x007aff,185|-101|0x007aff,43|-96|0x007aff,34|254|0x007aff,48|252|0xffffff,-247|67|0xd3d6da,19|12|0xf9f9f9",90,30,893,468,1263}
}
TT相册授权界面3={
	界面特征={'TT相册授权界面',0x3478f6, "104|12|0x3478f6,175|14|0x3478f6,28|383|0x3478f6,143|370|0x3478f6,59|381|0xffffff,198|130|0x3478f6,299|373|0xffffff,-65|372|0xffffff",90,222,885,592,1274}
}
TT相册界面={
	界面特征={'TT相册界面',0x161823, "178|7|0x161823,116|11|0xffffff,11|-45|0xe0e0e0,170|-48|0xe0e0e0",90,285,70,469,136}
}
TT相册界面2={
	界面特征={'TT相册界面',0x161823, "0|2|0xafb0b3,324|7|0x161823,340|5|0x909196,278|9|0xffffff,302|20|0x161823,304|20|0x94959a,299|20|0xffffff",90,65,120,413,145}
}
TT相册界面3={
	界面特征={'TT相册界面',0x161823, "324|-15|0x161823,340|-16|0x161823,342|-14|0x595b62,341|-18|0x909196,280|-14|0xffffff,-11|-8|0xaeafb3",90,53,44,412,68}
}
--erkang--
TT相册界面4={
	界面特征={'TT相册界面',0x000000, "-149|59|0xffffff,-234|72|0x161823,50|75|0x161823", 90,53,18,343,99}
}
TT相册界面5={
	界面特征={'TT相册界面5',0xd1d3d1, "60|49|0xffffff,-3|69|0x000000,113|72|0xeeeeef,399|163|0xeeeeef,-238|69|0x3c3e46", 90, 1, 37, 741, 291}
}

TT确认头像界面={
	界面特征={'TT确认头像界面',0x161823, "240|6|0x161823,298|9|0x161823,527|0|0xfe2c55,563|18|0xfe2c55,292|13|0xffffff",90,126,1272,695,1296}
}
TT确认头像界面2={
	界面特征={'TT确认头像界面',0x161823, "97|7|0x161823,334|3|0x161823,392|10|0x161823,614|-3|0xfe2c55,681|6|0xfe2c55,616|15|0xfe7a94,643|5|0xfe728e",90,31,1274,718,1298}
}


TT选择兴趣界面={
	界面特征={'TT选择兴趣界面',0xe6e6e7, "0|126|0xe3e4e5,16|185|0xfdfdfd,1|373|0xe3e4e5,142|378|0x161823",90,60,871,209,1256}
}
TT选择兴趣界面2={
	界面特征={'TT选择兴趣界面2',0xe4e4e6, "4|95|0xe4e4e6,2|128|0xe4e4e6,2|127|0xf8f8f8,2|129|0xffffff,10|223|0xe4e4e6",90,165,814,180,1057}
}

--erkang--选择兴趣
TT选择兴趣界面3={
	界面特征={'TT选择兴趣界面3',0x161823, "293|20|0x161823,570|-87|0x8a8b90,142|238|0x4f5159,201|1073|0xf1f1f2,279|1080|0xa6a7ab", 90,67,81,643,1254}
}
TT选择兴趣界面4={
	界面特征={'TT选择兴趣界面4',0x8a8b91, "28|3|0x8a8b91,9|1172|0xf1f1f2,-197|1170|0xf1f1f2,-324|1170|0xf1f1f2,-525|1166|0xf1f1f2,-281|1177|0xa6a7ab", 90,113,83,672,1266}
}
TT选择兴趣界面5={
	界面特征={'TT选择兴趣界面3',0x161823, "290|18|0x161823,44|1066|0xffffff,128|1066|0x161823,546|1065|0xf1f1f2", 90, 10, 122, 718, 1308}
}
TT选择兴趣3按钮X=502
TT选择兴趣3按钮Y=812
TT选择兴趣4按钮X=654
TT选择兴趣4按钮Y=83
TT选择兴趣5按钮X=218
TT选择兴趣5按钮Y=1264




TT开始看界面={
	界面特征={'TT开始看界面',0xfe2c55, "-30|5|0xffffff,6|82|0xfe2c55,336|43|0xffffff,620|40|0xfe2c55,622|40|0xffffff",90,33,1216,690,1305}
}
TT开始看界面2={
	界面特征={'TT开始看界面2',0xffffff, "0|1|0xfe2c55,2|88|0xfe2c55,2|89|0xffffff,566|5|0xfe2c55,566|62|0xfe2c55",90,116,1210,688,1305}
}
TT进入主页界面={
	界面特征={'TT进入主页界面',0x808080, "261|14|0x106b76,316|4|0x808080,340|9|0x7d1736",90,67,1258,419,1284}
}
TT弹窗界面1={
	界面特征={'TT弹窗界面1',0x161823, "1|4|0xffffff,479|6|0x161823,270|246|0xf1f1f2,258|293|0x161823,239|346|0xf1f1f2",90,134,471,619,823}
}
TT弹窗界面2={
	界面特征={'TT弹窗界面2',0x000000, "311|2|0x000000,120|251|0xb2b2b3,207|251|0xb2b2b2,108|293|0x007aff,293|293|0x007aff",90,213,519,530,818} --开通好友通知弹窗
}
TT弹窗界面3={
	界面特征={'TT弹窗界面3',0x161823, "238|9|0x161823,110|153|0x505159,-74|251|0x505159,122|231|0xe3e4e5,299|255|0x161823",90,176,615,555,876}--电话弹窗
}
TT弹窗界面4={
	界面特征={'TT弹窗界面4',0x161823, "469|1|0x161823,53|83|0x5a5c64,404|78|0x929398,37|291|0x505159,240|280|0xe4e4e5,378|295|0x161823",90,132,675,607,976}--找朋友
}
TT弹窗界面5={
	界面特征={'TT弹窗界面5',0x161823, "128|460|0xe3e3e4,240|460|0xe3e3e4,114|501|0x161823,195|507|0x40424b,137|556|0xe3e3e4,144|595|0x505159",90,219,377,465,978}
}
TT弹窗界面6={
	界面特征={'TT弹窗界面6',0x161823, "-478|-11|0xffffff,-470|24|0x161823,-137|171|0xfe2c55,-136|315|0xfe2c55,-37|187|0xffffff",90,169,213,653,545}
}--Your friends on TIKTOK
TT弹窗界面7={
	界面特征={'TT弹窗界面7',0x161823, "415|2|0x161823,101|477|0xe3e3e4,333|477|0xe3e3e4,107|573|0xe3e3e4,320|573|0xe3e3e4,210|527|0x161823",90,169,360,590,939}
}--ALLOW personalized ads?
TT弹窗界面8={
	界面特征={'TT弹窗界面8',0xe3e4e5, "190|31|0xe3e4e5,54|48|0x161823,201|39|0xffffff,221|43|0xfe2c55,499|5|0xfe2c55,354|45|0xffffff,351|78|0xfe2c55",90,173,1212,678,1296}
}--TIKTOK is better with friends!
TT弹窗界面9={
	界面特征={'TT弹窗界面9',0xf23b5e, "390|41|0x5086ff,56|253|0x161823,299|252|0x161823,265|500|0xffffff,320|534|0x161823",90,184,437,580,977}
}--Find your friends on tiktok
TT弹窗界面10={
	界面特征={'TT弹窗界面10',0xf23b5e, "377|11|0x5086ff,10|241|0x161823,414|241|0x161823,180|481|0xe4e4e5,307|489|0x1c1e29",90,192,462,612,957}
}--Find your friends on tiktok --open settings
TT弹窗界面11={
	界面特征={'TT弹窗界面11',0x000000, "439|5|0x000000,281|158|0x000000,351|46|0x000000,2|249|0x007aff,169|253|0x007aff,340|256|0x007aff,393|253|0x007aff",90,153,540,598,805}
}--“TikTok”Would 
TT弹窗界面12={
	界面特征={'TT弹窗界面12',0x000000, "327|6|0x000000,188|57|0x000000,326|62|0x000000,271|196|0x000000,-7|297|0x007aff,305|299|0x007aff,-62|290|0x007aff",90,154,519,550,824}
}--“TikTok”Would 
TT弹窗界面13={
	界面特征={'TT弹窗界面13',0x000000, "206|7|0x000000,0|20|0x000000,201|21|0x000000,-30|86|0x000000,50|252|0x007aff,-111|261|0x007aff,-111|248|0x007aff",90,157,541,480,808}
}--Find contacts
TT弹窗界面14={
	界面特征={'TT弹窗界面14',0x0be09b, "68|3|0x0be09b,31|31|0xffffff,29|43|0x0be09b,-176|374|0x505159,-94|370|0x505159,194|369|0x161823",90,163,502,539,882}
}--Find your friends on tiktok
TT弹窗界面15={
	界面特征={'TT弹窗界面15',0x000000, "0|22|0x000000,167|13|0x000000,199|21|0x000000,97|117|0x000000,-89|255|0x007aff,30|251|0x007aff",90,178,541,472,803}
}--Find contacts
TT弹窗界面16={
	界面特征={'TT弹窗界面16',0x000000, "421|11|0x000000,45|100|0x000000,372|102|0x000000,171|420|0x007aff,202|401|0x007aff,247|406|0x007aff,345|219|0x000000",90,163,461,590,888}
}
TT弹窗界面17={
	界面特征={'TT弹窗界面17',0x000000, "235|-2|0x000000,-18|130|0x000000,300|131|0x000000,197|205|0x000000,-1|387|0x007aff,207|395|0x007aff",90,271,475,578,878}
}
TT弹窗界面18={
	界面特征={'TT弹窗界面18',0x000000, "272|6|0x000000,-24|323|0x007aff,284|319|0x007aff,216|308|0x097dfd,120|409|0x007aff",90,218,462,532,877}
}
TT弹窗界面19={
	界面特征={'TT弹窗界面19',0x000000, "387|5|0x000000,388|5|0x333333,194|158|0xb2b2b1,317|108|0x000000,69|102|0x3e3e3e,87|102|0xf0f0f0",90,178,610,572,774}
}
TT弹窗界面20={
	界面特征={'TT弹窗界面20',0x0075fa, "67|-1|0x0075fa,5|54|0x0075fa,62|51|0x0075fa,30|27|0xffffff,13|138|0x161823,231|145|0x161823",90,337,469,575,621}
}--Find Facebook friends
TT弹窗界面21={
	界面特征={'TT弹窗界面21',0x007aff, "266|-245|0x000000,-96|-199|0x000000,-74|-248|0x000000,44|0|0x007aff",90,178,567,546,818}
}--Find Facebook friends



--erkang--
TT弹窗界面22={
	界面特征={'TT弹窗界面22',0x000000, "171|6|0x000000,298|233|0x007aff,62|247|0x007aff,177|199|0x9e9a99", 60,195,549,500,803}
}--connect with contacts

TT弹窗界面23={
	界面特征={'TT弹窗界面23',0x161823, "412|4|0x161823,-58|52|0x4f5159,327|451|0x4f5159,167|627|0x161823,244|633|0x161823,195|734|0x4f5159", 90,110,313,586,1053}
}--allow personalized ads?

TT弹窗界面24={
	界面特征={'TT弹窗界面24',0x007aff, "108|2|0x007aff,101|-1|0x007aff,284|-2|0x007aff,348|-9|0x007aff,396|-1|0x007aff,414|-1|0x007aff", 90,157,807,577,825}
}--Sync your contacts to wasily find peopel...

TT弹窗界面26={
	界面特征={'TT弹窗界面26',0x000000, "90|14|0x000000,110|51|0x000000,151|89|0x000000,124|100|0x000000,171|173|0x000000,382|188|0x000000,535|133|0xc3bfbc", 90, 94, 448, 746, 877}
}--Sync your contacts to wasily find peopel...


TT选择相册225 = {
		界面特征={'TT选择相册225',0x161722, "354|132|0xd0d2d4,336|4|0x161722,4|507|0x8a8b90,76|509|0x8a8b90,669|602|0x8b8c90", 90, 5, 44, 741, 833}
	}
TT相册授权界面4 = {
	界面特征={'TT相册授权界面4',0xa7a8a9, "-132|586|0x3478f6,-143|720|0x3478f6,-108|958|0x3478f6,73|964|0xffffff", 90, 2, 198, 748, 1322}
	}

TT弹窗界面25={
	界面特征={'TT弹窗界面25',0x007aff, "152|-3|0x007aff,284|2|0x007aff,403|5|0x007aff", 90,156,782,566,802}
}--connect with contacts

--------1665相册-----------
注册1665相册界面 = {
	界面特征 = {'注册1665相册界面',0xf1f1f2, "17|46|0xffffff,-75|175|0x161722,58|184|0x161722,-317|321|0x161722,-70|-151|0x161722,-3|-151|0x161722,20|107|0xf1f1f2", 90, 7, 44, 744, 583}
}

注册1665选择照片界面 = {
	界面特征 = {'注册1665选择照片界面',0x161722, "277|6|0x161722,593|4|0x161722,446|-70|0xd2d4d1", 90, 9, 43, 743, 187}
}
注册1665选择相册界面 = {
	界面特征 = {'注册1665选择相册界面',0x161722, "34|2|0x161722,73|-1|0x161722,55|-66|0xd1d3d0,389|142|0xc4c4c6", 90, 6, 49, 740, 356}
}
注册1665选择照片界面2 = {
	界面特征 = {'注册1665选择照片界面2',0x161722, "35|1|0x161722,290|-8|0x161722,616|-1|0x161722,24|74|0x000000,163|-2|0xffffff,713|3|0x161722", 90, 7, 40, 738, 188}
}
注册1665选择相册界面2 = {
	界面特征 = {'注册1665选择相册界面2',0x161722, "21|0|0x161722,60|-4|0x161722,82|3|0x161722,90|-1|0x161722,104|1|0xffffff,-8|-2|0xffffff", 90, 20, 40, 749, 116}
}
注册1665授权相册界面 = {
	界面特征 = {'注册1665授权相册界面',0x000000, "136|2|0x000000,128|54|0x000000,-65|257|0x007aff,268|262|0x007aff,154|-199|0xc0c0c1", 90, 15, 166, 695, 873}
}
注册1665授权相册界面2 = {
	界面特征 = {'注册1665授权相册界面2',0x909091, "1|-37|0x989898,2|-56|0x909091,-12|-254|0x0d0e15,-47|-257|0x0d0e15,-77|-257|0x0d0e15,133|467|0x007afe,144|464|0x007afe,-338|202|0x0e0f15,335|208|0x535457", 90, 2, 50, 748, 904}
}


TT弹窗界面1按钮X=366
TT弹窗界面1按钮Y=871
TT弹窗界面2按钮X=509
TT弹窗界面2按钮Y=815
TT弹窗界面3按钮X=225
TT弹窗界面3按钮Y=868
TT弹窗界面4按钮X=230
TT弹窗界面4按钮Y=972
TT弹窗界面5按钮X=364
TT弹窗界面5按钮Y=891
TT弹窗界面6按钮X=650
TT弹窗界面6按钮Y=226
TT弹窗界面7按钮X=382
TT弹窗界面7按钮Y=890
TT弹窗界面8按钮X=521
TT弹窗界面8按钮Y=1259
TT弹窗界面9按钮X=511
TT弹窗界面9按钮Y=970
TT弹窗界面10按钮X=231
TT弹窗界面10按钮Y=950
TT弹窗界面11按钮X=494
TT弹窗界面11按钮Y=799
TT弹窗界面12按钮X=504
TT弹窗界面12按钮Y=811
TT弹窗界面13按钮X=252
TT弹窗界面13按钮Y=795
TT弹窗界面14按钮X=216
TT弹窗界面14按钮Y=866
TT弹窗界面15按钮X=252
TT弹窗界面15按钮Y=795
TT弹窗界面16按钮X=373
TT弹窗界面16按钮Y=785
TT弹窗界面17按钮X=373
TT弹窗界面17按钮Y=785
TT弹窗界面18按钮X=373
TT弹窗界面18按钮Y=868
TT弹窗界面19按钮X=242
TT弹窗界面19按钮Y=814
TT弹窗界面20按钮X=214
TT弹窗界面20按钮Y=885
TT弹窗界面21按钮X=253
TT弹窗界面21按钮Y=812
--erkang--
TT弹窗界面22按钮X=222
TT弹窗界面22按钮Y=788
TT弹窗界面23按钮X=372
TT弹窗界面23按钮Y=953
TT弹窗界面24按钮X=476
TT弹窗界面24按钮Y=800
TT弹窗界面26按钮X=508
TT弹窗界面26按钮Y=816
TT弹窗界面25按钮X=245
TT弹窗界面25按钮Y=794




TT界面列表={TT主界面,TT主界面2,TT主界面3,
			TT个人主页界面,TT管理账户界面,
			TT相册授权界面,TT打开相册界面2,打开相册界面,TT相册授权界面2,TT相册授权界面3,TT相册授权界面4,
			TT设置和隐私界面,TT企业设置界面,TT选择企业类型界面,TT弹窗欢迎光临界面,TT弹窗欢迎光临界面2,
			TT弹窗访问照片权限界面,TT个人资料设置界面,TT个人资料设置界面2,TT设置个性签名界面,TT设置链接界面,TT打开相册界面,
			TT相册界面,TT相册界面2,TT相册界面3,TT相册界面4,TT确认头像界面,TT确认头像界面2,
			TT弹窗界面1,TT弹窗界面2,TT弹窗界面3,TT弹窗界面4,TT开始看界面,TT开始看界面2,TT弹窗界面5,TT弹窗界面6,TT弹窗界面7,
			TT弹窗界面8,TT弹窗界面9,TT弹窗界面10,TT弹窗界面11,TT弹窗界面12,TT弹窗界面13,TT弹窗界面14,TT弹窗界面15,
			TT弹窗界面16,TT弹窗界面17,TT弹窗界面18,TT弹窗界面19,TT弹窗界面20,TT弹窗界面21,TT弹窗界面22,TT弹窗界面23,
			TT弹窗界面24,TT弹窗界面25,
			TT进入主页界面,TT选择兴趣界面,TT选择兴趣界面2,TT选择兴趣界面3,TT选择兴趣界面4,TT选择兴趣界面5,
			TT选择相册225
			,注册1665选择照片界面,注册1665相册界面,注册1665选择照片界面2,注册1665选择相册界面,注册1665选择相册界面2,注册1665授权相册界面,
			注册1665授权相册界面2,TT相册界面5}
		
键盘坐标={{372,1278},{127,956},{378,957},{625,953},{130,1054},{377,1055},{624,1056},{131,1162},{377,1162},{623,1160}}--0~9第一个是0的坐标

TT无website界面={
	界面特征={'TT无website界面',0x161823, "2|0|0xdfdfe1,46|0|0x30313b,209|-5|0x8a8b91,182|72|0xd0d1d3,591|72|0xd0d1d3",90,104,952,701,1035}
}

TT无website界面列表={TT无website界面}
me按钮X=674
me按钮Y=1270

个人主页设置按钮X=691   -----个人主页右上角三个点
个人主页设置按钮Y=83

左上角返回X=48
左上角返回Y=84

管理账户按钮X=239  -- Manage account 第一个按钮
管理账户按钮Y=262

切换到专业账户按钮X=327    --Switch to pro account 
切换到专业账户按钮Y=672

企业版next按钮X=371    ---选择企业版的NEXT按钮
企业版next按钮Y=1240

企业类型按钮X=358   --这是第二个类型
企业类型按钮Y=589

企业类型next按钮X=371
企业类型next按钮Y=1197

个人主页edit按钮X=346
个人主页edit按钮Y=598

弹窗欢迎光临edit按钮X=368 --Edit profile按钮
弹窗欢迎光临edit按钮Y=760

弹窗访问照片权限ok按钮X=503
弹窗访问照片权限ok按钮Y=816

资料设置头像按钮X=376
资料设置头像按钮Y=280

资料设置头像按钮2X=218
资料设置头像按钮2Y=285

资料设置bio按钮X=373    -----设置个性签名按钮
资料设置bio按钮Y=854

资料设置website按钮X=375  ------设置链接
资料设置website按钮Y=964

个性签名输入框X=370
个性签名输入框Y=175

个性签名设置save按钮X=690   ---这个点需要采颜色 要注意
个性签名设置save按钮Y=85
save按钮颜色=0xfe2c55

链接输入框X=297
链接输入框Y=186

选择相册按钮X=371  -- 选择的是Upload photo
选择相册按钮Y=1017

相册间隔=188   --横向和纵向间隔一样

相册初始位置X=97   --第二排第一个照片的中心位置
相册初始位置Y=384

头像save按钮X=679
头像save按钮Y=1285

选择兴趣skip按钮X=206
选择兴趣skip按钮Y=1253

开始看界面start按钮X=373
开始看界面start按钮Y=1257

TT弹窗退出按钮X=366
TT弹窗退出按钮Y=871

TT相册授权按钮X=367
TT相册授权按钮Y=1017
--------------打码平台------------
打码X偏移量=105
起始坐标X=152
起始坐标Y=847

---------------黑豹-------------------
HB主界面={
	界面特征={'HB主界面',0x00bbf3, "148|34|0x00bbf3,-352|147|0x2e5fbf,-311|528|0xde9c32,-427|1233|0x141110,-393|1230|0x453d39",90,104,78,685,1317}
}
新机按钮X=601
新机按钮Y=100
首页按钮X=123
首页按钮Y=1307
HB广告界面={
	界面特征={'HB广告界面',0x00bbf3, "159|-10|0x00bbf3,149|24|0x00bbf3,6|31|0x00bbf3,46|11|0xffffff,37|11|0xffffff,-226|138|0x6bae48",90,298,76,689,230}
}
我知道了按钮X=528
我知道了按钮Y=565
HB提示1界面={
	界面特征={'HB提示1界面',0x272220, "419|-1215|0x007092,240|-740|0x000000,292|-739|0x000000,103|-562|0x007aff,268|-573|0xdaae13,379|-546|0x007aff",90,104,95,529,1316}
}--提示新机

--erkang----------------------------------
HB提示3界面={
	界面特征={'HB提示1界面',0x252525, "472|10|0x0095c2,272|525|0x000000,317|528|0x000000,384|581|0x000000,452|584|0x000000,144|709|0x007aff,405|706|0x007aff", 90, 72,71,550,786}
}--提示新机
------------------------------------------

提示1确定按钮X=492
提示1确定按钮Y=759
HB提示2界面={
	界面特征={'HB提示2界面',0x272220, "417|-1209|0x007092,237|-724|0x000000,289|-724|0x000000,97|-611|0xdaae13,460|-611|0xdab713,253|-566|0x007aff",90,107,102,573,1317}
}--提示新机失败
提示失败确定按钮X=377
提示失败确定按钮Y=747

-----erkang-------

HB提示4界面={
	界面特征={'HB提示4界面',0x252525, "472|11|0x0095c2,23|147|0x224997,268|541|0x000000,266|693|0x007aff,313|682|0x007aff,41|1188|0x2a2523", 90,76,71,554,1265}	
}
提示失败确定按钮2X=377
提示失败确定按钮2Y=768


HB刷新界面={
	界面特征={'HB刷新界面',0x010101, "418|-1219|0x007092,183|-787|0x1b1e26,352|-796|0x1a1e25,186|-665|0xf7f6f6,127|-690|0x855e1e",90,111,92,535,1317}
}
HB备份界面={
	界面特征={'HB备份界面',0x9a9a9a, "34|-1|0x929292,249|2|0x070707,284|3|0x000000,255|14|0x000000,255|13|0xaeacad,503|-1|0x929292,528|4|0x979797,528|10|0xf8f8f8",90,104,1310,638,1329}
}
备份按钮X=371   -- 可以切换到备份界面的下方的 备份按钮
备份按钮Y=1310
HB备份刷新界面={
	界面特征={'HB备份刷新界面',0x959595, "54|-19|0x959595,85|12|0x959595,27|6|0x000000,44|9|0x010101,-215|8|0x5d5d5d",90,116,1284,421,1318}
}
HB备份管理界面={
	界面特征={'HB备份管理界面',0x007aff, "147|1|0x007aff,13|116|0x007aff,61|-164|0x8f8f8f,17|346|0x007aff,49|622|0x007aff",90,298,487,451,1279}
}
还原按钮X=361
还原按钮Y=1016
HB提示还原界面={
	界面特征={'HB提示还原界面',0x000000, "51|2|0x000000,235|-501|0x252525,-77|163|0x007aff,152|159|0x007aff",90,266,84,584,754}
}
HB界面列表={HB广告界面,HB提示1界面,HB提示2界面,HB提示3界面,HB提示4界面,HB刷新界面,HB主界面,HB备份界面,HB备份刷新界面,HB备份管理界面,HB提示还原界面}


--------------------PyApp界面--------------------------
 PyApp主界面={
     界面特征={'PyApp主界面',0xffffff, "35|1|0xffffff,338|14|0xffffff,-166|1191|0x275ac9,202|1204|0x868b95,-224|127|0x275ac9", 90, 8, 46, 710, 1322}
 }
 
PyApp新机界面 = {
	 界面特征={'PyApp新机界面',0x000000, "145|-1|0x000000,-83|233|0x275ac9,-39|233|0x275ac9,200|232|0xe64c44,227|239|0xe64c44", 90,212,550,528,800}
	}

PyApp等待界面 = {
	 界面特征={'PyApp等待界面',0x748299, "158|517|0xf7f7f7,253|512|0x2c2c2c,428|511|0x000000,245|566|0x000000,334|512|0x000000,382|511|0x000000", 90,15,80,450,651}
	}

新机按钮X =652
新机按钮Y =234

确定新机X = 516
确定新机Y = 787

 PyApp界面列表={PyApp主界面,PyApp新机界面,PyApp等待界面}
-------------------------------------------------------


--------------------界面--------------------------


